In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('3.Car info One hot encoding.csv')
df

        Car Model  Mileage  Sell Price  Age
0          BMW X5    69000       18000    6
1          BMW X5    35000       34000    3
2          BMW X5    27000       26100    5
3          BMW X5    22500       40000    2
4          BMW X5    46000       31500    4
5            Audi    59000       29400    5
6            Audi    52000       32000    5
7            Audi    72000       19300    6
8            Audi    91000       12000    8
9   Mercedez Benz    67000       22000    6
10  Mercedez Benz    83000       20000    7
11  Mercedez Benz    79000       21000    7
12  Mercedez Benz    59000       33000    5
13         Toyota    51000       42000    4
14         Toyota    65000       32000    7
15         Toyota    39000       55000    5

# Milege, sell price and Age ,these are numerical form but car model has string,so we have to convert string into numerical form

In [5]:
dummies = pd.get_dummies(df['Car Model'])
dummies

    Audi  BMW X5  Mercedez Benz  Toyota
0      0       1              0       0
1      0       1              0       0
2      0       1              0       0
3      0       1              0       0
4      0       1              0       0
5      1       0              0       0
6      1       0              0       0
7      1       0              0       0
8      1       0              0       0
9      0       0              1       0
10     0       0              1       0
11     0       0              1       0
12     0       0              1       0
13     0       0              0       1
14     0       0              0       1
15     0       0              0       1

In [6]:
merged =pd.concat([df,dummies],axis='columns')
merged

,Car Model,Mileage,Sell Price,Age,Audi,BMW X5,Mercedez Benz,Toyota
0,BMW X5,69000,18000,6,0,1,0,0
1,BMW X5,35000,34000,3,0,1,0,0
2,BMW X5,27000,26100,5,0,1,0,0
3,BMW X5,22500,40000,2,0,1,0,0
4,BMW X5,46000,31500,4,0,1,0,0
5,Audi,59000,29400,5,1,0,0,0
6,Audi,52000,32000,5,1,0,0,0
7,Audi,72000,19300,6,1,0,0,0
8,Audi,91000,12000,8,1,0,0,0
9,Mercedez Benz,67000,22000,6,0,0,1,0
10,Mercedez Benz,83000,20000,7,0,0,1,0
11,Mercedez Benz,79000,21000,7,0,0,1,0
12,Mercedez Benz,59000,33000,5,0,0,1,0
13,Toyota,51000,42000,4,0,0,0,1
14,Toyota,65000,32000,7,0,0,0,1
15,Toyota,39000,55000,5,0,0,0,1

In [7]:
#all data store in merged now delet or drop car model column
final =merged.drop(['Car Model'],axis='columns')
final

    Mileage  Sell Price  Age  Audi  BMW X5  Mercedez Benz  Toyota
0     69000       18000    6     0       1              0       0
1     35000       34000    3     0       1              0       0
2     27000       26100    5     0       1              0       0
3     22500       40000    2     0       1              0       0
4     46000       31500    4     0       1              0       0
5     59000       29400    5     1       0              0       0
6     52000       32000    5     1       0              0       0
7     72000       19300    6     1       0              0       0
8     91000       12000    8     1       0              0       0
9     67000       22000    6     0       0              1       0
10    83000       20000    7     0       0              1       0
11    79000       21000    7     0       0              1       0
12    59000       33000    5     0       0              1       0
13    51000       42000    4     0       0              0       1
14    65000       32000    7     0       0              0       1
15    39000       55000    5     0       0              0       1

In [8]:
#only dependent value is sell price so
y =df['Sell Price']
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     29400
6     32000
7     19300
8     12000
9     22000
10    20000
11    21000
12    33000
13    42000
14    32000
15    55000
Name: Sell Price, dtype: int64

In [9]:
#now all value in final so
x= final.drop(['Sell Price'],axis=1)
x

    Mileage  Age  Audi  BMW X5  Mercedez Benz  Toyota
0     69000    6     0       1              0       0
1     35000    3     0       1              0       0
2     27000    5     0       1              0       0
3     22500    2     0       1              0       0
4     46000    4     0       1              0       0
5     59000    5     1       0              0       0
6     52000    5     1       0              0       0
7     72000    6     1       0              0       0
8     91000    8     1       0              0       0
9     67000    6     0       0              1       0
10    83000    7     0       0              1       0
11    79000    7     0       0              1       0
12    59000    5     0       0              1       0
13    51000    4     0       0              0       1
14    65000    7     0       0              0       1
15    39000    5     0       0              0       1

# complete seperate x and y so now use linear regression

In [17]:
from sklearn.linear_model import LinearRegression

In [20]:
model =LinearRegression()
model

LinearRegression()

In [21]:
#fit then predict
model.fit(x,y)

LinearRegression()

In [22]:
model.score(x,y)

0.9094216291451025

In [23]:
 # 1 for audi so others are zero
model.predict([[45000,8,1,0,0,0]])

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([23563.07021987])

In [ ]:
#youtube video link:https://www.youtube.com/watch?v=19GsHwaH9WY&list=PLKdU0fuY4OFfWY36nDJDlI26jXwInSm8f&index=21